In [2]:
import pandas as pd
import numpy as np

In [43]:
df = pd.read_csv('data/train.csv')

In [44]:
df.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [46]:
rand_fem_age = rand_age_female = pd.Series(np.random.randint(df.groupby('Sex')['Age'].mean()['female'] - df.groupby('Sex')['Age'].std()['female'], 
                                            df.groupby('Sex')['Age'].mean()['female'] + df.groupby('Sex')['Age'].std()['female'],
                            size = 1000))

df.loc[(df['Age'].isnull()) & (df['Sex'] == 'female'), 'Age'] = rand_fem_age

rand_male_age = pd.Series(np.random.randint(df.groupby('Sex')['Age'].mean()['male'] - df.groupby('Sex')['Age'].std()['male'], 
                                            df.groupby('Sex')['Age'].mean()['male'] + df.groupby('Sex')['Age'].std()['male'],
                            size = 1000))
df.loc[(df['Age'].isnull()) & (df['Sex'] == 'male'), 'Age'] = rand_male_age

In [9]:
titles = df['Name'].str.partition(',')[2].str.split()
df['Title'] = titles.map(lambda x: x[0])
df.loc[df['Age'] < 2, 'Title'] = 'Kid'

In [10]:
surv_title = df.groupby('Title')['Survived'].mean().reset_index()
surv_title = surv_title.sort_values('Survived', ascending = True)
surv_title

        Title  Survived
0       Capt.  0.000000
15       Rev.  0.000000
2        Don.  0.000000
4   Jonkheer.  0.000000
12        Mr.  0.156673
3         Dr.  0.428571
7      Major.  0.500000
8     Master.  0.500000
1        Col.  0.500000
9       Miss.  0.691011
13       Mrs.  0.792000
5         Kid  0.857143
16       Sir.  1.000000
10      Mlle.  1.000000
11       Mme.  1.000000
14        Ms.  1.000000
6       Lady.  1.000000
17        the  1.000000

In [12]:
df.groupby('Pclass')['Survived'].mean()

Pclass
1    0.629630
2    0.472826
3    0.242363
Name: Survived, dtype: float64

In [13]:
df.loc[df['Embarked'].isnull(), 'Embarked'] = 'S'
df.groupby('Embarked')['Survived'].mean()

Embarked
C    0.553571
Q    0.389610
S    0.339009
Name: Survived, dtype: float64

In [14]:
print(max(df['Fare']))
print(min(df['Fare']))

512.3292
0.0

In [15]:
df.groupby(pd.qcut(df['Fare'], 6))['Survived'].mean()

Fare
(-0.001, 7.775]      0.205128
(7.775, 8.662]       0.190789
(8.662, 14.454]      0.366906
(14.454, 26.0]       0.436242
(26.0, 52.369]       0.417808
(52.369, 512.329]    0.697987
Name: Survived, dtype: float64

In [18]:
df.groupby('Parch')['Survived'].mean()

Parch
0    0.343658
1    0.550847
2    0.500000
3    0.600000
4    0.000000
5    0.200000
6    0.000000
Name: Survived, dtype: float64

In [19]:
df.groupby('SibSp')['Survived'].mean()

SibSp
0    0.345395
1    0.535885
2    0.464286
3    0.250000
4    0.166667
5    0.000000
8    0.000000
Name: Survived, dtype: float64

In [21]:
df['Family'] = df['SibSp'] + df['Parch']
df.groupby('Family')['Survived'].mean()

Family
0     0.303538
1     0.552795
2     0.578431
3     0.724138
4     0.200000
5     0.136364
6     0.333333
7     0.000000
10    0.000000
Name: Survived, dtype: float64

In [56]:
df['Age'].describe()

count    891.000000
mean      29.430045
std       13.541233
min        0.420000
25%       21.000000
50%       28.000000
75%       37.000000
max       80.000000
Name: Age, dtype: float64

In [60]:
df.groupby([pd.cut(df['Age'], [0, 10, 20, 30, 40, 50, 60, 70, 80]), 'Sex'])['Survived'].mean()

Age       Sex
(0, 10]   female    0.612903
          male      0.575758
(10, 20]  female    0.687500
          male      0.119565
(20, 30]  female    0.758242
          male      0.162562
(30, 40]  female    0.802632
          male      0.197080
(40, 50]  female    0.685714
          male      0.200000
(50, 60]  female    0.928571
          male      0.142857
(60, 70]  female    1.000000
          male      0.071429
(70, 80]  male      0.200000
Name: Survived, dtype: float64

In [59]:
df.groupby('Sex')['Survived'].mean()

Sex
female    0.742038
male      0.188908
Name: Survived, dtype: float64

In [61]:
df.groupby([pd.cut(df['Age'], [0, 5, 80]), 'Sex'])['Survived'].mean()

Age      Sex
(0, 5]   female    0.761905
         male      0.652174
(5, 80]  female    0.740614
         male      0.169675
Name: Survived, dtype: float64